[
  {
    "category": "Confidence",
    "affirmation": "I believe in my ability to succeed",
    "successMessage": "Yes! You just sent a powerful signal of self-belief to your subconscious. Carry that with you."
  },
  {
    "category": "Confidence",
    "affirmation": "I am worthy of my dreams",
    "successMessage": "Excellent. You've affirmed your worthiness. Your mind is now more open to seeing opportunities."
  },
  {
    "category": "Confidence",
    "affirmation": "I step forward with courage and grace",
    "successMessage": "Beautifully said. You just programmed your mind to handle the day with poise and strength."
  },
  {
    "category": "Career",
    "affirmation": "I am a valuable asset to my team",
    "successMessage": "You are. By saying it, you've reinforced your professional value in your own mind, which is where it counts most."
  },
  {
    "category": "Career",
    "affirmation": "My work makes a positive impact",
    "successMessage": "It does. You just connected your actions to a sense of purpose. Powerful stuff."
  },
  {
    "category": "Career",
    "affirmation": "I attract new career opportunities",
    "successMessage": "Your mind is now a magnet for professional growth. Be ready for it!"
  },
  {
    "category": "Mindfulness",
    "affirmation": "I am fully present in this moment",
    "successMessage": "Perfect. You've anchored yourself in the now, the only place where life truly happens."
  },
  {
    "category": "Mindfulness",
    "affirmation": "I observe my thoughts without judgment",
    "successMessage": "That is the heart of mindfulness. You just gave yourself the gift of inner peace."
  },
  {
    "category": "Mindfulness",
    "affirmation": "My breath is my calm anchor",
    "successMessage": "Wonderful. You've reinforced your connection to your body's own natural stress-reliever."
  },
  {
    "category": "Health",
    "affirmation": "I make choices that support my well being",
    "successMessage": "You just set a powerful intention for your health. Your body thanks you!"
  },
  {
    "category": "Health",
    "affirmation": "My body is strong and heals itself",
    "successMessage": "Amazing. You've activated your belief in your body's incredible resilience and strength."
  },
  {
    "category": "Health",
    "affirmation": "I listen to what my body needs",
    "successMessage": "Excellent. You just strengthened the connection between your mind and body. Listen closely today."
  },
  {
    "category": "Relationships",
    "affirmation": "I attract loving and supportive people",
    "successMessage": "Your energy is now tuned to the frequency of positive relationships. Be open to who appears."
  },
  {
    "category": "Relationships",
    "affirmation": "I communicate with kindness and respect",
    "successMessage": "You just set the standard for your interactions today. This will make a real difference."
  },
  {
    "category": "Wealth",
    "affirmation": "I am open to receiving abundance",
    "successMessage": "The doors to prosperity are now open in your mind. You have declared your readiness to receive."
  },
  {
    "category": "Wealth",
    "affirmation": "I am a responsible steward of my money",
    "successMessage": "Excellent. You've reinforced a mindset of financial wisdom and control."
  },
  {
    "category": "Creativity",
    "affirmation": "My creativity flows freely and easily",
    "successMessage": "You just unlocked the channels of creative thought. Get ready for some great ideas!"
  },
  {
    "category": "Creativity",
    "affirmation": "I see the world from a unique perspective",
    "successMessage": "Yes you do! You just gave yourself permission to trust your unique creative voice."
  }
]